tylertms/dspic33e-sim/conformance/gpio.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} GpioConformance;

static const uint16_t tris_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e00u, 0x0e10u, 0x0e20u, 0x0e30u, 0x0e40u, 0x0e50u, 0x0e60u};
static const uint16_t port_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e02u, 0x0e12u, 0x0e22u, 0x0e32u, 0x0e42u, 0x0e52u, 0x0e62u};
static const uint16_t latch_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e04u, 0x0e14u, 0x0e24u, 0x0e34u, 0x0e44u, 0x0e54u, 0x0e64u};
static const uint16_t open_drain_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e06u, 0x0e16u, 0x0e26u, 0x0e36u, 0x0e46u, 0x0e56u, 0x0e66u};
static const uint16_t change_notification_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e08u, 0x0e18u, 0x0e28u, 0x0e38u, 0x0e48u, 0x0e58u, 0x0e68u};
static const uint16_t analog_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e0eu, 0x0e1eu, 0x0e2eu, 0x0e3eu, 0x0e4eu, 0u, 0x0e6eu};
static const uint16_t pull_up_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e0au, 0x0e1au, 0x0e2au, 0x0e3au, 0x0e4au, 0x0e5au, 0x0e6au};
static const uint16_t pull_down_addresses[DSPIC33_GPIO_PORT_COUNT] = {
    0x0e0cu, 0x0e1cu, 0x0e2cu, 0x0e3cu, 0x0e4cu, 0x0e5cu, 0x0e6cu};
static const uint16_t port_masks[DSPIC33_GPIO_PORT_COUNT] = {
    0xc6ffu, 0xffffu, 0xf01eu, 0xffffu, 0x03ffu, 0x313fu, 0xf3cfu};
static const uint16_t latch_masks[DSPIC33_GPIO_PORT_COUNT] = {
    0xc6ffu, 0xffffu, 0xf01eu, 0xffffu, 0x03ffu, 0x313fu, 0xf3c3u};
static const uint16_t analog_masks[DSPIC33_GPIO_PORT_COUNT] = {
    0x06c0u, 0xffffu, 0x601eu, 0x00c0u, 0x03ffu, 0u, 0x03c0u};
static const uint16_t input_only_masks[DSPIC33_GPIO_PORT_COUNT] = {0u, 0u, 0u,     0u,
                                                                   0u, 0u, 0x000cu};
static const uint16_t pull_masks[DSPIC33_GPIO_PORT_COUNT] = {
    0xc6ffu, 0xffffu, 0xf01eu, 0xffffu, 0x03ffu, 0x313fu, 0xf3c3u};
static const uint16_t open_drain_masks[DSPIC33_GPIO_PORT_COUNT] = {
    0xc03fu, 0u, 0u, 0xff3fu, 0u, 0x313fu, 0xf003u};
enum {
    CHANGE_NOTIFICATION_FLAG = 0x0008u,
    CHANGE_NOTIFICATION_IRQ = 19u,
    CHANGE_NOTIFICATION_VECTOR = 0x0360u
};

static void expect(GpioConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[gpio-failed] %s\n", name);
    }
}

static void reset_port(Dspic33* cpu, uint8_t port, uint16_t input) {
    dspic33_gpio_input(cpu, port, input);
    dspic33_reset(cpu, 0u);
    if (analog_addresses[port] != 0u) {
        dspic33_write_word(cpu, analog_addresses[port], 0u);
    }
}

static void reset_released_port(Dspic33* cpu, uint8_t port) {
    dspic33_gpio_input(cpu, port, 0u);
    dspic33_gpio_release(cpu, port, port_masks[port]);
    dspic33_reset(cpu, 0u);
    if (analog_addresses[port] != 0u) {
        dspic33_write_word(cpu, analog_addresses[port], 0u);
    }
}

static uint16_t expected_pins(uint8_t port, uint16_t input, uint16_t tris,
                              uint16_t latch, uint16_t analog) {
    uint16_t inputs = (uint16_t)((tris & latch_masks[port]) | input_only_masks[port]);
    return (uint16_t)(((input & inputs & ~analog) | (latch & ~inputs)) &
                      port_masks[port]);
}

static bool change_notification_flag(Dspic33* cpu) {
    return (dspic33_read_word(cpu, 0x0802u) & CHANGE_NOTIFICATION_FLAG) != 0u;
}

static void clear_change_notification_flag(Dspic33* cpu) {
    dspic33_write_word(
        cpu, 0x0802u,
        (uint16_t)(dspic33_read_word(cpu, 0x0802u) & ~CHANGE_NOTIFICATION_FLAG));
}

static void configure_change_notification_pin(Dspic33* cpu, uint8_t port,
                                              uint16_t bit) {
    reset_released_port(cpu, port);
    dspic33_write_word(cpu, tris_addresses[port], bit);
    dspic33_read_word(cpu, port_addresses[port]);
    dspic33_write_word(cpu, change_notification_addresses[port], bit);
    clear_change_notification_flag(cpu);
}

static void core_cases(GpioConformance* state, Dspic33* cpu) {
    uint8_t port;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint16_t mixed_tris = (uint16_t)(0xaaaau & latch_masks[port]);
        uint16_t mixed_expected;
        reset_port(cpu, port, 0x3cc3u);
        dspic33_write_word(cpu, tris_addresses[port], 0u);
        dspic33_write_word(cpu, latch_addresses[port], 0xa55au);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0x3cc3u, 0u, 0xa55au, 0u),
               "PORT output read uses LAT");
        dspic33_gpio_input(cpu, port, 0xffffu);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0xffffu, 0u, 0xa55au, 0u),
               "PORT output read ignores external inputs");
        dspic33_write_word(cpu, tris_addresses[port], latch_masks[port]);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0xffffu, latch_masks[port], 0xa55au, 0u),
               "PORT input read uses external levels");
        dspic33_gpio_input(cpu, port, 0x3cc3u);
        dspic33_write_word(cpu, tris_addresses[port], mixed_tris);
        mixed_expected = expected_pins(port, 0x3cc3u, mixed_tris, 0xa55au, 0u);
        expect(state, dspic33_read_word(cpu, port_addresses[port]) == mixed_expected,
               "PORT read composes mixed input and output pins");

        dspic33_write_word(cpu, tris_addresses[port], 0u);
        dspic33_write_word(cpu, port_addresses[port], 0x5aa5u);
        expect(state,
               dspic33_read_word(cpu, latch_addresses[port]) ==
                   (uint16_t)(0x5aa5u & latch_masks[port]),
               "PORT word write updates LAT");
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0x3cc3u, 0u, 0x5aa5u, 0u),
               "PORT word write reads back physical pins");

        dspic33_write_word(cpu, tris_addresses[port], latch_masks[port]);
        dspic33_gpio_input(cpu, port, 0x0f0fu);
        dspic33_write_word(cpu, port_addresses[port], 0xa55au);
        expect(state,
               dspic33_read_word(cpu, latch_addresses[port]) ==
                   (uint16_t)(0xa55au & latch_masks[port]),
               "PORT input-mode write stores LAT value");
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0x0f0fu, latch_masks[port], 0xa55au, 0u),
               "PORT input-mode write leaves input read unchanged");
        dspic33_write_word(cpu, tris_addresses[port], 0u);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   expected_pins(port, 0x0f0fu, 0u, 0xa55au, 0u),
               "PORT stored input-mode LAT appears after output selection");

        dspic33_gpio_input(cpu, port, 0xffffu);
        dspic33_write_word(cpu, tris_addresses[port], 0xffffu);
        dspic33_write_word(cpu, latch_addresses[port], 0xffffu);
        expect(state,
               (dspic33_read_word(cpu, port_addresses[port]) &
                (uint16_t)~port_masks[port]) == 0u,
               "PORT unimplemented bits read zero");

        dspic33_write_word(cpu, latch_addresses[port], 0xa55au);
        dspic33_write_byte(cpu, port_addresses[port], 0x3cu);
        expect(state,
               dspic33_read_word(cpu, latch_addresses[port]) ==
                   (uint16_t)(0x003cu & latch_masks[port]),
               "PORT low-byte write zero-extends into LAT");
        dspic33_write_byte(cpu, (uint16_t)(port_addresses[port] + 1u), 0xc3u);
        expect(state,
               dspic33_read_word(cpu, latch_addresses[port]) ==
                   (uint16_t)(0xc300u & latch_masks[port]),
               "PORT high-byte write zero-extends into LAT");
    }
}

