tylertms/dspic33e-sim/conformance/gpio.c
static void analog_cases(GpioConformance* state, Dspic33* cpu) {
    uint8_t port;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint16_t mixed_tris;
        uint16_t expected;
        if (analog_addresses[port] == 0u) {
            continue;
        }
        reset_port(cpu, port, analog_masks[port]);
        dspic33_write_word(cpu, tris_addresses[port], latch_masks[port]);
        dspic33_write_word(cpu, latch_addresses[port], 0u);
        dspic33_write_word(cpu, analog_addresses[port], analog_masks[port]);
        expect(state, dspic33_read_word(cpu, port_addresses[port]) == 0u,
               "ANSEL suppresses external digital input");
        dspic33_write_word(cpu, tris_addresses[port], 0u);
        dspic33_write_word(cpu, latch_addresses[port], analog_masks[port]);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) == analog_masks[port],
               "ANSEL preserves LAT-driven output");
        dspic33_write_word(cpu, tris_addresses[port], latch_masks[port]);
        dspic33_write_word(cpu, latch_addresses[port], 0u);
        dspic33_write_word(cpu, analog_addresses[port], 0u);
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) == analog_masks[port],
               "clearing ANSEL reveals external input");
        mixed_tris = (uint16_t)(0xaaaau & latch_masks[port]);
        dspic33_gpio_input(cpu, port, 0xffffu);
        dspic33_write_word(cpu, tris_addresses[port], mixed_tris);
        dspic33_write_word(cpu, latch_addresses[port], 0x5555u);
        dspic33_write_word(cpu, analog_addresses[port], analog_masks[port]);
        expected =
            expected_pins(port, 0xffffu, mixed_tris, 0x5555u, analog_masks[port]);
        expect(state, dspic33_read_word(cpu, port_addresses[port]) == expected,
               "ANSEL gates only mixed external input path");
    }
}

static void input_only_usb_cases(GpioConformance* state, Dspic33* cpu) {
    reset_port(cpu, 6u, 0x000cu);
    dspic33_write_word(cpu, tris_addresses[6], 0u);
    dspic33_write_word(cpu, latch_addresses[6], 0u);
    expect(state, (dspic33_read_word(cpu, port_addresses[6]) & 0x000cu) == 0x000cu,
           "RG2 and RG3 reflect high external inputs");
    dspic33_gpio_input(cpu, 6u, 0u);
    expect(state, (dspic33_read_word(cpu, port_addresses[6]) & 0x000cu) == 0u,
           "RG2 and RG3 reflect low external inputs");
    dspic33_gpio_input(cpu, 6u, 0x000cu);
    dspic33_write_word(cpu, port_addresses[6], 0x000cu);
    expect(state, (dspic33_read_word(cpu, latch_addresses[6]) & 0x000cu) == 0u,
           "RG2 and RG3 writes do not create LAT bits");
    dspic33_write_word(cpu, 0x04cau, 0x0001u);
    expect(state, (dspic33_read_word(cpu, port_addresses[6]) & 0x000cu) == 0u,
           "USBEN suppresses RG2 and RG3 digital input");
    dspic33_write_word(cpu, 0x04cau, 0u);
    expect(state, (dspic33_read_word(cpu, port_addresses[6]) & 0x000cu) == 0x000cu,
           "disabling USB reveals RG2 and RG3 input");
}

static void pull_cases(GpioConformance* state, Dspic33* cpu) {
    uint8_t port;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        reset_released_port(cpu, port);
        dspic33_write_word(cpu, tris_addresses[port], latch_masks[port]);
        expect(state,
               cpu->io.gpio_driven[port] == 0u &&
                   dspic33_read_word(cpu, port_addresses[port]) == 0u,
               "released GPIO inputs use deterministic floating-low fallback");

        dspic33_write_word(cpu, pull_up_addresses[port], pull_masks[port]);
        expect(state, dspic33_read_word(cpu, port_addresses[port]) == pull_masks[port],
               "released GPIO inputs resolve through weak pull-ups");

        expect(state,
               dspic33_gpio_drive(cpu, port, 0u, pull_masks[port]) &&
                   dspic33_read_word(cpu, port_addresses[port]) == 0u,
               "actively driven low GPIO inputs override weak pull-ups");

        dspic33_write_word(cpu, pull_up_addresses[port], 0u);
        dspic33_write_word(cpu, pull_down_addresses[port], pull_masks[port]);
        dspic33_gpio_drive(cpu, port, pull_masks[port], pull_masks[port]);
        expect(state,
               dspic33_gpio_release(cpu, port, pull_masks[port]) &&
                   cpu->io.gpio[port] == pull_masks[port] &&
                   cpu->io.gpio_driven[port] == 0u &&
                   dspic33_read_word(cpu, port_addresses[port]) == 0u,
               "released GPIO inputs resolve through weak pull-downs");
    }

    reset_released_port(cpu, 1u);
    expect(state,
           dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u) &&
               cpu->io.gpio[1] == 0x0001u && cpu->io.gpio_driven[1] == 0x0001u,
           "masked GPIO drive changes only the selected pin");
    expect(state,
           dspic33_gpio_drive(cpu, 1u, 0u, 0x0002u) && cpu->io.gpio[1] == 0x0001u &&
               cpu->io.gpio_driven[1] == 0x0003u,
           "masked GPIO drive preserves sibling levels");
    expect(state,
           dspic33_gpio_release(cpu, 1u, 0x0001u) && cpu->io.gpio[1] == 0x0001u &&
               cpu->io.gpio_driven[1] == 0x0002u,
           "masked GPIO release preserves sibling drive state");

    reset_released_port(cpu, 0u);
    expect(state,
           dspic33_gpio_drive(cpu, 0u, 0xffffu, 0xffffu) &&
               cpu->io.gpio[0] == port_masks[0] &&
               cpu->io.gpio_driven[0] == port_masks[0],
           "GPIO drive masks unimplemented pins");
    expect(state,
           !dspic33_gpio_drive(cpu, DSPIC33_GPIO_PORT_COUNT, 0u, 1u) &&
               !dspic33_gpio_release(cpu, DSPIC33_GPIO_PORT_COUNT, 1u),
           "GPIO drive APIs reject invalid ports");

    {
        bool high = false;
        reset_released_port(cpu, 3u);
        dspic33_write_word(cpu, tris_addresses[3], 0u);
        dspic33_write_word(cpu, latch_addresses[3], 0x0100u);
        expect(state, dspic33_gpio_pin(cpu, 3u, 8u, &high) && high,
               "resolved pin API observes LAT-driven output");
        dspic33_write_word(cpu, tris_addresses[3], 0x0100u);
        dspic33_write_word(cpu, pull_up_addresses[3], 0x0100u);
        dspic33_gpio_drive(cpu, 3u, 0u, 0x0100u);
        expect(state, dspic33_gpio_pin(cpu, 3u, 8u, &high) && !high,
               "resolved pin API observes driven-low input");
        expect(state,
               !dspic33_gpio_pin(cpu, DSPIC33_GPIO_PORT_COUNT, 0u, &high) &&
                   !dspic33_gpio_pin(cpu, 3u, 16u, &high) &&
                   !dspic33_gpio_pin(cpu, 3u, 8u, NULL),
               "resolved pin API rejects invalid observations");
    }
}

static void open_drain_cases(GpioConformance* state, Dspic33* cpu) {
    uint8_t port;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint16_t mask = open_drain_masks[port];
        reset_port(cpu, port, 0u);
        dspic33_write_word(cpu, open_drain_addresses[port], 0xffffu);
        expect(state, dspic33_read_word(cpu, open_drain_addresses[port]) == mask,
               "open-drain register follows the device pin mask");
        if (mask == 0u) {
            continue;
        }
        dspic33_write_word(cpu, tris_addresses[port], 0u);
        dspic33_write_word(cpu, latch_addresses[port], mask);
        expect(state, (dspic33_read_word(cpu, port_addresses[port]) & mask) == 0u,
               "released open-drain output follows driven-low external state");
        dspic33_gpio_drive(cpu, port, mask, mask);
        expect(state, (dspic33_read_word(cpu, port_addresses[port]) & mask) == mask,
               "released open-drain output follows driven-high external state");
        dspic33_write_word(cpu, latch_addresses[port], 0u);
        expect(state, (dspic33_read_word(cpu, port_addresses[port]) & mask) == 0u,
               "open-drain zero overrides external high state");
        dspic33_write_word(cpu, open_drain_addresses[port], 0u);
        dspic33_write_word(cpu, latch_addresses[port], mask);
        dspic33_gpio_drive(cpu, port, 0u, mask);
        expect(state, (dspic33_read_word(cpu, port_addresses[port]) & mask) == mask,
               "push-pull output ignores external low state");
        dspic33_gpio_release(cpu, port, mask);
        dspic33_write_word(cpu, pull_up_addresses[port], mask);
        dspic33_write_word(cpu, open_drain_addresses[port], mask);
        expect(state, (dspic33_read_word(cpu, port_addresses[port]) & mask) == mask,
               "released open-drain output resolves through enabled pull-up");
    }
}

static void change_notification_port_cases(GpioConformance* state, Dspic33* cpu) {
    uint8_t port;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint8_t bit_index;
        for (bit_index = 0u; bit_index < 16u; bit_index++) {
            uint16_t bit = (uint16_t)(1u << bit_index);
            if ((port_masks[port] & bit) == 0u) {
                continue;
            }
            configure_change_notification_pin(cpu, port, bit);
            expect(state, !change_notification_flag(cpu),
                   "enabled change-notification pin starts matched");
            dspic33_gpio_drive(cpu, port, bit, bit);
            expect(state, change_notification_flag(cpu),
                   "enabled input transition raises CNIF");
            expect(state,
                   (dspic33_read_word(cpu, port_addresses[port]) & bit) == bit &&
                       change_notification_flag(cpu),
                   "PORT read acknowledges mismatch without clearing CNIF");
            clear_change_notification_flag(cpu);
            expect(state, !change_notification_flag(cpu),
                   "CNIF clears after PORT acknowledgement");
            dspic33_gpio_drive(cpu, port, 0u, bit);
            expect(state, change_notification_flag(cpu),
                   "opposite input transition raises a new CNIF");
            expect(state,
                   (cpu->io.gpio_cn_reference[port] & bit) == bit &&
                       (cpu->io.gpio_cn_values[port] & bit) == 0u &&
                       (cpu->io.gpio_cn_qualified[port] & bit) != 0u,
                   "change-notification state retains the last PORT sample");
        }
    }
}

static void change_notification_sequence_cases(GpioConformance* state, Dspic33* cpu) {
    configure_change_notification_pin(cpu, 1u, 0x0101u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    clear_change_notification_flag(cpu);
    dspic33_gpio_drive(cpu, 1u, 0x0100u, 0x0100u);
    expect(state, change_notification_flag(cpu),
           "second pin change reasserts CNIF during an existing mismatch");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    clear_change_notification_flag(cpu);
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "return to the unread reference clears the pin mismatch");
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "same pin reasserts CNIF after returning to its reference");

