tylertms/dspic33e-sim/conformance/gpio.c
    configure_change_notification_pin(cpu, 1u, 0x0101u);
    dspic33_gpio_drive(cpu, 1u, 0x0101u, 0x0101u);
    expect(state, change_notification_flag(cpu), "multi-lane input change raises CNIF");
    clear_change_notification_flag(cpu);
    expect(state, !change_notification_flag(cpu),
           "clear-before-read does not immediately reassert CNIF");
    expect(state, dspic33_read_byte(cpu, port_addresses[1]) == 0x01u,
           "low PORT byte read returns the selected lane");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0100u);
    expect(state, change_notification_flag(cpu),
           "low PORT byte read acknowledges the entire port");

    configure_change_notification_pin(cpu, 1u, 0x0101u);
    dspic33_gpio_drive(cpu, 1u, 0x0101u, 0x0101u);
    clear_change_notification_flag(cpu);
    expect(state, dspic33_read_byte(cpu, (uint16_t)(port_addresses[1] + 1u)) == 0x01u,
           "high PORT byte read returns the selected lane");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "high PORT byte read acknowledges the entire port");

    reset_released_port(cpu, 1u);
    dspic33_write_word(cpu, tris_addresses[1], 0x0001u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    dspic33_write_word(cpu, change_notification_addresses[1], 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "enabling CN on a changed pin baselines its current state");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "transition after CN enable raises CNIF");
    dspic33_write_word(cpu, change_notification_addresses[1], 0u);
    clear_change_notification_flag(cpu);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "disabled CN pin does not raise CNIF");
    dspic33_write_word(cpu, change_notification_addresses[1], 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "re-enabled CN pin baselines after disabled transitions");
}

static void change_notification_qualification_cases(GpioConformance* state,
                                                    Dspic33* cpu) {
    reset_released_port(cpu, 1u);
    dspic33_write_word(cpu, tris_addresses[1], 0u);
    dspic33_write_word(cpu, change_notification_addresses[1], 0x0001u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "output-configured pin suppresses change notification");
    dspic33_write_word(cpu, tris_addresses[1], 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "input qualification baselines the current pin state");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "qualified digital input detects the next transition");

    reset_released_port(cpu, 1u);
    dspic33_write_word(cpu, analog_addresses[1], 0x0001u);
    dspic33_write_word(cpu, tris_addresses[1], 0x0001u);
    dspic33_write_word(cpu, change_notification_addresses[1], 0x0001u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "analog input suppresses change notification");
    dspic33_write_word(cpu, analog_addresses[1], 0u);
    expect(state, !change_notification_flag(cpu),
           "digital qualification after ANSEL clear baselines the input");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "digital input detects transition after ANSEL clear");

    reset_released_port(cpu, 6u);
    dspic33_write_word(cpu, change_notification_addresses[6], 0x0004u);
    dspic33_write_word(cpu, 0x04cau, 0x0001u);
    dspic33_gpio_drive(cpu, 6u, 0x0004u, 0x0004u);
    expect(state, !change_notification_flag(cpu),
           "USB ownership suppresses RG2 change notification");
    dspic33_write_word(cpu, 0x04cau, 0u);
    expect(state, !change_notification_flag(cpu),
           "released USB ownership baselines RG2 input");
    dspic33_gpio_drive(cpu, 6u, 0u, 0x0004u);
    expect(state, change_notification_flag(cpu),
           "RG2 detects transitions after USB release");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    dspic33_write_word(cpu, pull_up_addresses[1], 0x0001u);
    expect(state, change_notification_flag(cpu), "weak pull-up transition raises CNIF");
    dspic33_read_word(cpu, port_addresses[1]);
    clear_change_notification_flag(cpu);
    dspic33_write_word(cpu, pull_up_addresses[1], 0u);
    dspic33_write_word(cpu, pull_down_addresses[1], 0x0001u);
    expect(state, change_notification_flag(cpu),
           "weak pull-down transition raises CNIF");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    dspic33_write_word(cpu, pull_up_addresses[1], 0x0001u);
    dspic33_gpio_release(cpu, 1u, 0x0001u);
    expect(state,
           change_notification_flag(cpu) &&
               (dspic33_read_word(cpu, port_addresses[1]) & 0x0001u) != 0u,
           "released external drive detects pull-resolved input change");
}

static void configure_change_notification_interrupt(Dspic33* cpu, uint8_t priority) {
    dspic33_write_word(cpu, 0x0822u, CHANGE_NOTIFICATION_FLAG);
    dspic33_write_word(cpu, 0x0848u, (uint16_t)((uint16_t)priority << 12u));
    dspic33_load_program_word(cpu, 0x003au, CHANGE_NOTIFICATION_VECTOR);
    dspic33_load_program_word(cpu, CHANGE_NOTIFICATION_VECTOR, 0u);
    cpu->w[15] = 0x1800u;
}

static void change_notification_interrupt_cases(GpioConformance* state, Dspic33* cpu) {
    configure_change_notification_pin(cpu, 1u, 0x0001u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, change_notification_flag(cpu) && !dspic33_device_wake(cpu),
           "CNIF sets in Sleep without IEC wake eligibility");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    configure_change_notification_interrupt(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, !dspic33_device_wake(cpu),
           "priority-zero CN interrupt cannot wake the CPU");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    configure_change_notification_interrupt(cpu, 2u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state,
           dspic33_device_wake(cpu) && cpu->interrupt_count == 0u &&
               cpu->w[15] == 0x1800u && change_notification_flag(cpu),
           "equal-priority CN event wakes without an interrupt frame");
    cpu->sr = 0u;
    expect(state,
           dspic33_device_service_interrupt(cpu) &&
               cpu->last_interrupt == CHANGE_NOTIFICATION_IRQ &&
               cpu->pc == CHANGE_NOTIFICATION_VECTOR,
           "retained CNIF vectors after lowering IPL");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    configure_change_notification_interrupt(cpu, 3u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == CHANGE_NOTIFICATION_IRQ &&
               cpu->pc == CHANGE_NOTIFICATION_VECTOR && cpu->w[15] == 0x1804u,
           "higher-priority CN event wakes through IRQ19 vector");
    expect(state, dspic33_read_word(cpu, 0x08c8u) == 0x031bu,
           "interrupt status identifies the CN vector and priority");

    configure_change_notification_pin(cpu, 1u, 0x0001u);
    configure_change_notification_interrupt(cpu, 3u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == CHANGE_NOTIFICATION_IRQ &&
               cpu->pc == CHANGE_NOTIFICATION_VECTOR,
           "CN continues in Idle and wakes through IRQ19 vector");
}

static void change_notification_dma_lifecycle_cases(GpioConformance* state,
                                                    Dspic33* cpu) {
    Dspic33 copy;
    bool initialized;
    configure_change_notification_pin(cpu, 1u, 0x0001u);
    dspic33_write_word(cpu, 0x2200u, 0x5aa5u);
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, CHANGE_NOTIFICATION_IRQ);
    dspic33_write_word(cpu, 0x0b04u, 0x2200u);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, port_addresses[1]);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0xa001u);
    dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
    expect(state, change_notification_flag(cpu), "CN event raises interrupt flag");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x5aa5u && cpu->io.dma_index[0] == 0u &&
               cpu->io.dma_active == 0u &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "CN interrupt produces no DMA request");

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize change-notification copy");
    if (!initialized) {
        return;
    }
    expect(state,
           dspic33_copy(&copy, cpu) &&
               copy.io.gpio_cn_reference[1] == cpu->io.gpio_cn_reference[1] &&
               copy.io.gpio_cn_values[1] == cpu->io.gpio_cn_values[1] &&
               copy.io.gpio_cn_qualified[1] == cpu->io.gpio_cn_qualified[1] &&
               change_notification_flag(&copy),
           "copy preserves active change-notification state");
    dspic33_read_word(cpu, port_addresses[1]);
    clear_change_notification_flag(cpu);
    expect(state,
           !change_notification_flag(cpu) && change_notification_flag(&copy) &&
               cpu->io.gpio_cn_reference[1] != copy.io.gpio_cn_reference[1],
           "copied change-notification references diverge independently");
    dspic33_destroy(&copy);

