tylertms/dspic33e-sim/conformance/gpio.c
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, change_notification_addresses[1]) == 0u &&
               !change_notification_flag(cpu) &&
               cpu->io.gpio_cn_reference[1] == cpu->io.gpio_cn_values[1],
           "warm reset clears CN controls and resynchronizes retained pins");
    dspic33_write_word(cpu, analog_addresses[1], 0u);
    dspic33_write_word(cpu, change_notification_addresses[1], 0x0001u);
    expect(state, !change_notification_flag(cpu),
           "CN enable after warm reset baselines retained pin state");
    dspic33_gpio_drive(cpu, 1u, 0u, 0x0001u);
    expect(state, change_notification_flag(cpu),
           "retained pin detects transition after warm reset");

    dspic33_reset(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, change_notification_addresses[1]) == 0u &&
               !change_notification_flag(cpu) &&
               cpu->io.gpio_cn_reference[1] == cpu->io.gpio_cn_values[1],
           "cold reset clears CN state and synchronizes retained pins");
}

static uint8_t mode_select_value(Dspic33* cpu) {
    uint16_t port_d = dspic33_read_word(cpu, port_addresses[3]);
    uint16_t port_e = dspic33_read_word(cpu, port_addresses[4]);
    return (uint8_t)(((port_d >> 1u) & 1u) | ((port_d >> 11u) & 2u) |
                     ((port_d >> 11u) & 4u) | ((port_e >> 6u) & 8u) |
                     ((port_e >> 4u) & 0x10u));
}

static void firmware_pull_cases(GpioConformance* state, Dspic33* cpu) {
    uint16_t port_d_inputs = 0x3002u;
    uint16_t port_e_inputs = 0x0300u;
    dspic33_gpio_release(cpu, 3u, port_masks[3]);
    dspic33_gpio_release(cpu, 4u, port_masks[4]);
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, analog_addresses[3], 0u);
    dspic33_write_word(cpu, analog_addresses[4], 0u);
    dspic33_write_word(cpu, tris_addresses[3], port_d_inputs);
    dspic33_write_word(cpu, tris_addresses[4], port_e_inputs);
    dspic33_write_word(cpu, pull_down_addresses[3], port_d_inputs);
    dspic33_write_word(cpu, pull_up_addresses[4], port_e_inputs);
    expect(state, mode_select_value(cpu) == 0x18u,
           "firmware mode-select pulls resolve released D and E pins");

    expect(state,
           dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u) &&
               mode_select_value(cpu) == 0x19u,
           "firmware mode-select external high overrides D pull-down");
    expect(state,
           dspic33_gpio_drive(cpu, 4u, 0u, 0x0100u) && mode_select_value(cpu) == 0x09u,
           "firmware mode-select external low overrides E pull-up");
    expect(state,
           dspic33_gpio_release(cpu, 3u, 0x0002u) &&
               dspic33_gpio_release(cpu, 4u, 0x0100u) &&
               mode_select_value(cpu) == 0x18u,
           "firmware mode-select release restores weak-pull values");

    dspic33_write_word(cpu, analog_addresses[4], port_e_inputs);
    expect(state, mode_select_value(cpu) == 0u,
           "analog mode suppresses weak-pull digital input");
    dspic33_write_word(cpu, tris_addresses[4], 0u);
    dspic33_write_word(cpu, latch_addresses[4], port_e_inputs);
    expect(state, mode_select_value(cpu) == 0x18u,
           "LAT outputs override analog input and weak pulls");

    reset_released_port(cpu, 1u);
    dspic33_write_word(cpu, tris_addresses[1], 0xffffu);
    dspic33_write_byte(cpu, pull_up_addresses[1], 0x5au);
    expect(state, dspic33_read_word(cpu, port_addresses[1]) == 0x005au,
           "low-byte weak pull-up write affects only low pins");
    dspic33_write_byte(cpu, (uint16_t)(pull_up_addresses[1] + 1u), 0xa5u);
    expect(state, dspic33_read_word(cpu, port_addresses[1]) == 0xa55au,
           "high-byte weak pull-up write preserves low pins");

    reset_released_port(cpu, 6u);
    dspic33_write_word(cpu, tris_addresses[6], latch_masks[6]);
    dspic33_write_word(cpu, pull_up_addresses[6], 0xffffu);
    expect(state,
           (dspic33_read_word(cpu, port_addresses[6]) & input_only_masks[6]) == 0u,
           "RG2 and RG3 have no weak-pull controls");
    dspic33_write_word(cpu, 0x04cau, 0x0001u);
    expect(state,
           (dspic33_read_word(cpu, port_addresses[6]) & input_only_masks[6]) == 0u &&
               (dspic33_read_word(cpu, port_addresses[6]) & pull_masks[6]) ==
                   pull_masks[6],
           "USB mode suppresses only its dedicated released GPIO inputs");
}

static bool run_bit_instruction(Dspic33* cpu, uint32_t opcode, uint16_t address) {
    dspic33_set_working_register(cpu, 4u, address);
    return dspic33_load_program_word(cpu, 0u, opcode) &&
           dspic33_step(cpu) == DSPIC33_RUNNING;
}

static void read_modify_write_cases(GpioConformance* state, Dspic33* cpu) {
    reset_port(cpu, 3u, 0x00f0u);
    dspic33_write_word(cpu, tris_addresses[3], 0xffffu);
    dspic33_write_word(cpu, latch_addresses[3], 0xffffu);
    expect(state,
           run_bit_instruction(cpu, 0xa00014u, port_addresses[3]) &&
               dspic33_read_word(cpu, latch_addresses[3]) == 0x00f1u,
           "PORT BSET reads pins and writes modified LAT");

    reset_port(cpu, 3u, 0x00f0u);
    dspic33_write_word(cpu, tris_addresses[3], 0xffffu);
    dspic33_write_word(cpu, latch_addresses[3], 0xffffu);
    expect(state,
           run_bit_instruction(cpu, 0xa14014u, port_addresses[3]) &&
               dspic33_read_word(cpu, latch_addresses[3]) == 0x00e0u,
           "PORT BCLR reads pins and writes modified LAT");

    reset_port(cpu, 3u, 0xffffu);
    dspic33_write_word(cpu, tris_addresses[3], 0xffffu);
    dspic33_write_word(cpu, latch_addresses[3], 0x1000u);
    expect(state,
           run_bit_instruction(cpu, 0xa00014u, latch_addresses[3]) &&
               dspic33_read_word(cpu, latch_addresses[3]) == 0x1001u,
           "LAT BSET reads and modifies latch state");
}

static void lifecycle_cases(GpioConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    uint8_t port;
    bool initialized;
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint16_t input = (uint16_t)(0x9696u ^ ((uint16_t)port * 0x1111u));
        dspic33_gpio_input(cpu, port, input);
        dspic33_reset(cpu, 0u);
        if (analog_addresses[port] != 0u) {
            dspic33_write_word(cpu, analog_addresses[port], 0u);
        }
        expect(state,
               dspic33_read_word(cpu, port_addresses[port]) ==
                   (uint16_t)(input & port_masks[port]),
               "MCU reset preserves physical GPIO stimulus");
    }

