tylertms/dspic33e-sim/conformance/gpio.c
    for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
        uint16_t driven =
            (uint16_t)((0x5555u ^ ((uint16_t)port * 0x1111u)) & port_masks[port]);
        dspic33_gpio_input(cpu, port, 0u);
        dspic33_gpio_release(cpu, port, port_masks[port]);
        dspic33_gpio_drive(cpu, port, driven, driven);
        dspic33_reset(cpu, 0u);
        expect(state,
               cpu->io.gpio[port] == driven && cpu->io.gpio_driven[port] == driven,
               "MCU reset preserves partial GPIO drive state");
    }

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize GPIO copy destination");
    if (initialized) {
        for (port = 0u; port < DSPIC33_GPIO_PORT_COUNT; port++) {
            dspic33_gpio_input(cpu, port,
                               (uint16_t)(0x1234u + (uint16_t)port * 0x1111u));
        }
        expect(state,
               dspic33_copy(&copy, cpu) && copy.io.gpio[0] == 0x0234u &&
                   copy.io.gpio[1] == 0x2345u && copy.io.gpio[2] == 0x3016u &&
                   copy.io.gpio[3] == 0x4567u && copy.io.gpio[4] == 0x0278u &&
                   copy.io.gpio[5] == 0x2109u && copy.io.gpio[6] == 0x708au,
               "copy preserves independent GPIO stimulus");
        expect(state,
               copy.io.gpio_driven[0] == port_masks[0] &&
                   copy.io.gpio_driven[1] == port_masks[1] &&
                   copy.io.gpio_driven[2] == port_masks[2] &&
                   copy.io.gpio_driven[3] == port_masks[3] &&
                   copy.io.gpio_driven[4] == port_masks[4] &&
                   copy.io.gpio_driven[5] == port_masks[5] &&
                   copy.io.gpio_driven[6] == port_masks[6],
               "copy preserves GPIO drive masks");
        dspic33_gpio_input(cpu, 0u, 0xffffu);
        dspic33_gpio_input(&copy, 1u, 0u);
        expect(state,
               copy.io.gpio[0] == 0x0234u && cpu->io.gpio[1] == 0x2345u &&
                   cpu->io.gpio[0] == 0xc6ffu && copy.io.gpio[1] == 0u,
               "copied GPIO stimuli remain independent");
        dspic33_gpio_release(cpu, 0u, 0x0001u);
        dspic33_gpio_release(&copy, 1u, 0x0002u);
        expect(state,
               (cpu->io.gpio_driven[0] & 0x0001u) == 0u &&
                   (copy.io.gpio_driven[0] & 0x0001u) != 0u &&
                   (copy.io.gpio_driven[1] & 0x0002u) == 0u &&
                   (cpu->io.gpio_driven[1] & 0x0002u) != 0u,
               "copied GPIO drive masks diverge independently");
        dspic33_destroy(&copy);
    }

    dspic33_gpio_input(cpu, 3u, 0u);
    dspic33_gpio_release(cpu, 3u, port_masks[3]);
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x2002u);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->io.gpio[3] == 0x0002u &&
               cpu->io.gpio_driven[3] == 0x2002u,
           "warm reset preserves partial GPIO drive state");

    {
        uint16_t retained = cpu->io.gpio[DSPIC33_GPIO_PORT_COUNT - 1u];
        dspic33_gpio_input(cpu, DSPIC33_GPIO_PORT_COUNT, 0xffffu);
        expect(state, cpu->io.gpio[DSPIC33_GPIO_PORT_COUNT - 1u] == retained,
               "invalid GPIO port input is ignored");
    }
}

int main(void) {
    Dspic33 cpu;
    GpioConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize GPIO processor");
    if (initialized) {
        core_cases(&state, &cpu);
        analog_cases(&state, &cpu);
        input_only_usb_cases(&state, &cpu);
        pull_cases(&state, &cpu);
        open_drain_cases(&state, &cpu);
        firmware_pull_cases(&state, &cpu);
        read_modify_write_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        change_notification_port_cases(&state, &cpu);
        change_notification_sequence_cases(&state, &cpu);
        change_notification_qualification_cases(&state, &cpu);
        change_notification_interrupt_cases(&state, &cpu);
        change_notification_dma_lifecycle_cases(&state, &cpu);
        expect(&state, state.cases == 750u, "GPIO assertion accounting");
        dspic33_destroy(&cpu);
    }
    printf("[gpio-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
